espressif/esp-idf/components/soc/esp32s2beta/include/soc/rtc_i2c_reg.h
// Copyright 2017-2018 Espressif Systems (Shanghai) PTE LTD
//
// Licensed under the Apache License, Version 2.0 (the "License");
// you may not use this file except in compliance with the License.
// You may obtain a copy of the License at
//
//     http://www.apache.org/licenses/LICENSE-2.0
//
// Unless required by applicable law or agreed to in writing, software
// distributed under the License is distributed on an "AS IS" BASIS,
// WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
// See the License for the specific language governing permissions and
// limitations under the License.
#ifndef _SOC_RTC_I2C_REG_H_
#define _SOC_RTC_I2C_REG_H_


#ifdef __cplusplus
extern "C" {
#endif
#include "soc.h"

/**
 * This file lists peripheral registers of an I2C controller which is part of the RTC.
 * ULP coprocessor uses this controller to implement I2C_RD and I2C_WR instructions.
 *
 * Part of the functionality of this controller (such as slave mode, and multi-byte
 * transfers) is not wired to the ULP, and is such, is not available to the
 * ULP programs.
 */

#define RTC_I2C_SCL_LOW_PERIOD_REG          (DR_REG_RTC_I2C_BASE + 0x0000)
/* RTC_I2C_SCL_LOW_PERIOD : R/W ;bitpos:[19:0] ;default: 20'h100 ; */
/*description: time period that scl = 0*/
#define RTC_I2C_SCL_LOW_PERIOD  0x000FFFFF
#define RTC_I2C_SCL_LOW_PERIOD_M  ((RTC_I2C_SCL_LOW_PERIOD_V)<<(RTC_I2C_SCL_LOW_PERIOD_S))
#define RTC_I2C_SCL_LOW_PERIOD_V  0xFFFFF
#define RTC_I2C_SCL_LOW_PERIOD_S  0

#define RTC_I2C_CTRL_REG          (DR_REG_RTC_I2C_BASE + 0x0004)
/* RTC_I2C_CLK_EN : R/W ;bitpos:[31] ;default: 1'b0 ; */
/*description: rtc i2c reg clk gating*/
#define RTC_I2C_CLK_EN  (BIT(31))
#define RTC_I2C_CLK_EN_M  (BIT(31))
#define RTC_I2C_CLK_EN_V  0x1
#define RTC_I2C_CLK_EN_S  31
/* RTC_I2C_RESET : R/W ;bitpos:[30] ;default: 1'b0 ; */
/*description: rtc i2c sw reset*/
#define RTC_I2C_RESET  (BIT(30))
#define RTC_I2C_RESET_M  (BIT(30))
#define RTC_I2C_RESET_V  0x1
#define RTC_I2C_RESET_S  30
/* RTC_I2C_RX_LSB_FIRST : R/W ;bitpos:[5] ;default: 1'b0 ; */
/*description: receive lsb first*/
#define RTC_I2C_RX_LSB_FIRST  (BIT(5))
#define RTC_I2C_RX_LSB_FIRST_M  (BIT(5))
#define RTC_I2C_RX_LSB_FIRST_V  0x1
#define RTC_I2C_RX_LSB_FIRST_S  5
/* RTC_I2C_TX_LSB_FIRST : R/W ;bitpos:[4] ;default: 1'b0 ; */
/*description: transit lsb first*/
#define RTC_I2C_TX_LSB_FIRST  (BIT(4))
#define RTC_I2C_TX_LSB_FIRST_M  (BIT(4))
#define RTC_I2C_TX_LSB_FIRST_V  0x1
#define RTC_I2C_TX_LSB_FIRST_S  4
/* RTC_I2C_TRANS_START : R/W ;bitpos:[3] ;default: 1'b0 ; */
/*description: force start*/
#define RTC_I2C_TRANS_START  (BIT(3))
#define RTC_I2C_TRANS_START_M  (BIT(3))
#define RTC_I2C_TRANS_START_V  0x1
#define RTC_I2C_TRANS_START_S  3
/* RTC_I2C_MS_MODE : R/W ;bitpos:[2] ;default: 1'b0 ; */
/*description: 1=master  0=slave*/
#define RTC_I2C_MS_MODE  (BIT(2))
#define RTC_I2C_MS_MODE_M  (BIT(2))
#define RTC_I2C_MS_MODE_V  0x1
#define RTC_I2C_MS_MODE_S  2
/* RTC_I2C_SCL_FORCE_OUT : R/W ;bitpos:[1] ;default: 1'b0 ; */
/*description: 1=push pull  0=open drain*/
#define RTC_I2C_SCL_FORCE_OUT  (BIT(1))
#define RTC_I2C_SCL_FORCE_OUT_M  (BIT(1))
#define RTC_I2C_SCL_FORCE_OUT_V  0x1
#define RTC_I2C_SCL_FORCE_OUT_S  1
/* RTC_I2C_SDA_FORCE_OUT : R/W ;bitpos:[0] ;default: 1'b0 ; */
/*description: 1=push pull  0=open drain*/
#define RTC_I2C_SDA_FORCE_OUT  (BIT(0))
#define RTC_I2C_SDA_FORCE_OUT_M  (BIT(0))
#define RTC_I2C_SDA_FORCE_OUT_V  0x1
#define RTC_I2C_SDA_FORCE_OUT_S  0

#define RTC_I2C_STATUS_REG          (DR_REG_RTC_I2C_BASE + 0x0008)
/* RTC_I2C_SCL_STATE_LAST : RO ;bitpos:[30:28] ;default: 3'b0 ; */
/*description: scl last status*/
#define RTC_I2C_SCL_STATE_LAST  0x00000007
#define RTC_I2C_SCL_STATE_LAST_M  ((RTC_I2C_SCL_STATE_LAST_V)<<(RTC_I2C_SCL_STATE_LAST_S))
#define RTC_I2C_SCL_STATE_LAST_V  0x7
#define RTC_I2C_SCL_STATE_LAST_S  28
/* RTC_I2C_SCL_MAIN_STATE_LAST : RO ;bitpos:[26:24] ;default: 3'b0 ; */
/*description: i2c last main status*/
#define RTC_I2C_SCL_MAIN_STATE_LAST  0x00000007
#define RTC_I2C_SCL_MAIN_STATE_LAST_M  ((RTC_I2C_SCL_MAIN_STATE_LAST_V)<<(RTC_I2C_SCL_MAIN_STATE_LAST_S))
#define RTC_I2C_SCL_MAIN_STATE_LAST_V  0x7
#define RTC_I2C_SCL_MAIN_STATE_LAST_S  24
/* RTC_I2C_SHIFT : RO ;bitpos:[23:16] ;default: 8'b0 ; */
/*description: shifter content*/
#define RTC_I2C_SHIFT  0x000000FF
#define RTC_I2C_SHIFT_M  ((RTC_I2C_SHIFT_V)<<(RTC_I2C_SHIFT_S))
#define RTC_I2C_SHIFT_V  0xFF
#define RTC_I2C_SHIFT_S  16
/* RTC_I2C_OP_CNT : RO ;bitpos:[7:6] ;default: 2'b0 ; */
/*description: which operation is working*/
#define RTC_I2C_OP_CNT  0x00000003
#define RTC_I2C_OP_CNT_M  ((RTC_I2C_OP_CNT_V)<<(RTC_I2C_OP_CNT_S))
#define RTC_I2C_OP_CNT_V  0x3
#define RTC_I2C_OP_CNT_S  6
/* RTC_I2C_BYTE_TRANS : RO ;bitpos:[5] ;default: 1'b0 ; */
/*description: One byte transit done*/
#define RTC_I2C_BYTE_TRANS  (BIT(5))
#define RTC_I2C_BYTE_TRANS_M  (BIT(5))
#define RTC_I2C_BYTE_TRANS_V  0x1
#define RTC_I2C_BYTE_TRANS_S  5
/* RTC_I2C_SLAVE_ADDRESSED : RO ;bitpos:[4] ;default: 1'b0 ; */
/*description: slave reg sub address*/
#define RTC_I2C_SLAVE_ADDRESSED  (BIT(4))
#define RTC_I2C_SLAVE_ADDRESSED_M  (BIT(4))
#define RTC_I2C_SLAVE_ADDRESSED_V  0x1
#define RTC_I2C_SLAVE_ADDRESSED_S  4
/* RTC_I2C_BUS_BUSY : RO ;bitpos:[3] ;default: 1'b0 ; */
/*description: bus is busy*/
#define RTC_I2C_BUS_BUSY  (BIT(3))
#define RTC_I2C_BUS_BUSY_M  (BIT(3))
#define RTC_I2C_BUS_BUSY_V  0x1
#define RTC_I2C_BUS_BUSY_S  3
/* RTC_I2C_ARB_LOST : RO ;bitpos:[2] ;default: 1'b0 ; */
/*description: arbitration is lost*/
#define RTC_I2C_ARB_LOST  (BIT(2))
#define RTC_I2C_ARB_LOST_M  (BIT(2))
#define RTC_I2C_ARB_LOST_V  0x1
#define RTC_I2C_ARB_LOST_S  2
/* RTC_I2C_SLAVE_RW : RO ;bitpos:[1] ;default: 1'b0 ; */
/*description: slave read or write*/
#define RTC_I2C_SLAVE_RW  (BIT(1))
#define RTC_I2C_SLAVE_RW_M  (BIT(1))
#define RTC_I2C_SLAVE_RW_V  0x1
#define RTC_I2C_SLAVE_RW_S  1
/* RTC_I2C_ACK_REC : RO ;bitpos:[0] ;default: 1'b0 ; */
/*description: ack response*/
#define RTC_I2C_ACK_REC  (BIT(0))
#define RTC_I2C_ACK_REC_M  (BIT(0))
#define RTC_I2C_ACK_REC_V  0x1
#define RTC_I2C_ACK_REC_S  0

